rubric = {
    "자기인식": {
        "감정인식": {
            "0": "부정확한 감정표현이 나 감정인식에 대한 자신 감 부족 표현",
            "1": "단순한 감정표현이 반 복되거나 정확한 감정인식 정도를 판단하기 힘든 정 도의 표현",
            "2": "정확한 감정표현이 반복되거나 정확한 감정인식 정도를 판단하기 쉬운 정도의 표현"
        },
        "맥락과 감정 연결 인식": {
            "0": "상황, 욕구, 가치, 사고 등의 맥락과 연결 하여 자신의 감정을 표현하지 못함",
            "1": "상황, 욕구, 가치, 사고 등의 일부 맥락과 감정을 연결하되 명확한 연결을 표현하 지 못함",
            "2": "감정과 상황, 욕구, 가치, 사고 등 다양한 맥락과 연결하여 자신의 감정을 정확히 표현"
        },
        "흥미와 목 적의식 인 식": {
            "0": "자신의 목적의식, 강점, 제한점에 대한 인 식 표현 부재",
            "1": "자신의 목적의식, 강점, 제한점을 인식하 는 표현",
            "2": "자신의 목적의식과 강점 및 제한점 인식을 넘어 자신의 편견까지 인식"
        },
    },
    "자기관리": {
        "정서관리": {
            "0": "자신의 감정을 표현하거나 조절하는 표현 부재",
            "1": "자신의 정서를 관리하는 표현을 하되 그 전략이 명확하지 못하거나 효과적이지 못함",
            "2": "자신의 감정을 표현하거나 조절하는 표현이 있고 일관성 있음"
        },
        "스트레스 관리": {
            "0": "스트레스를 표현하지만 스트레스를 관리하는 표현의 부재",
            "1": "스트레스를 표현하고 관리하는 전략을 표현 하되 그 전략이 명확하지 않거나 효과적이지 않음",
            "2": "스트레스를 표현하고 관리하려는 전략을 표 현하고 그 전략이 명확하고 효과적임"
        },
        "자기 동기 화와 주체 의식": {
            "0": "목적 달성을 위한 주체 의식(전략 수립과 실천의 능동성)을 가지고 자기 동기화(자기 격려, 칭찬, 보상 등) 표현의 부재",
            "1": "목적 달성을 위한 주체 의식(전략 수립과 실천의 능동성)을 가지고 자기 동기화(자기 격려, 칭찬, 보상 등)를 표현하되 그 전략이 명확하지 않거나 효과적이지 않음",
            "2": "목적 달성을 위한 주체 의식(전략 수립과 실천의 능동성)을 가지고 자기 동기화(자기 격려, 칭찬, 보상 등)를 표현하고 그 전략이 명확하고 효과적임"
        },
    },
    "사회적 인식": {
        "타인의 감정과 관점 인식": {
            "0": "타인의 감정이나 관점 인식 표현 부재",
            "1": "타인의 감정이나 관점 인식을 표현하되 그 인식이 정확하지 못하거나 명확하지 않음",
            "2": "타인의 감정이나 관점 을 인식하고 그 인식이 정확하고 명확함"
        },
        "타인 공감 하기": {
            "0": "타인의 감정에 대한 공감적(타인의 감정과 그 원인을 인지하고 유사한 자신의 감정 표현) 표현 부재",
            "1": "타인의 감정에 대한 공감적(타인의 감정과 그 원인을 인지하고 유사한 자신의 감정 표현) 표현을 하되 공감적 표현이 정확하거나 명확하지 않음",
            "2": "타인의 감정에 대한 공감적(타인의 감정과 그 원인을 인지하고 유사한 자신의 감정 표현) 표현을 하고 그 공감적 표현이 정확하고 명확함"
        },
        "사회적 맥락이 행동에 미치는 영향 인식": {
            "0": "사회적 맥락(조직이나 사회적 규준과 법규, 상황적 요구나 기회) 이 개인이나 집단의 행동에 미치는 영향에 대한 표현 부재",
            "1": "사회적 맥락(조직이나 사회적 규준과 법규, 상황적 요구나 기회) 이 개인이나 집단의 행동에 미치는 영향에 대한 표현을 하되 그 영향이 정확하거나 명확하지 않음",
            "2": "사회적 맥락(조직이나 사회적 규준과 법규, 상황적 요구나 기회) 이 개인이나 집단의 행동에 미치는 영향에 대한 표현을 하고 그 영향이 정확하거나 명확함"
        },
    },
    "관계 기술": {
        "건강하고 지지적 관계 수립": {
            "0": "비폭력 대화(경청, 평가와 판단의 말 회피, I 중심 소통 등) 능력 의 부재",
            "1": "비폭력 대화(경청, 평가와 판단의 말 회피, I 중심 소통 등)를 표 현하되 일부 능력만 표현하거 나 일관성 결여",
            "2": "비폭력 대화(경청, 평가와 판단의 말 회피, I 중심 소통 등)를 표 현하고 일관성 있게 표현"
        },
        "협력적 문제해결": {
            "0": "팀워크(책임감, 배려와 존중, 리더십)에 기반한 협력적 문제해 결 능력의 부재",
            "1": "팀워크(책임감, 배려와 존중, 리더십)에 기반한 협력적 문제해 결 능력을 표현하되 일관성이 결여",
            "2": "팀워크(책임감, 배려와 존중, 리더십)에 기반한 협력적 문제해 결 능력을 표현하고 일관성 있게 표현"
        },
        "갈등의 건 설적 해결": {
            "0": "갈등을 예방, 관리, 해결하는 표현 부재",
            "1": "갈등을 예방, 관리, 해결하는 표현을 하되 갈등 해결에 효과적인 영향을 주지 못함",
            "2": "갈등을 예방, 관리, 해결하는 표현을 하고 갈등 해결에 효과적인 영향을 미침"
        },
    },
    "책임있는 의사결정:": {
        "건설적인 선택": {
            "0": "정보, 자료, 사실에 근거하여 개인과 사회 문제를 윤리적이고 안전한 방식으로 규정하고 해결하는 표현 부재",
            "1": "정보, 자료, 사실에 근거하여 개인과 사회 문제를 윤리적이고 안전한 방식으로 규정하고 해결하되 근거가 부족하거나 윤리적이고 안전한 방식이 아닌 선택",
            "2": "충분하고 정확한 정보, 자료, 사실에 근거하여 개인과 사회 문제를 윤리적이고 안전한 방식으로 규정하고 해결"
        },
        "개인과 사회의 안녕 추구": {
            "0": "개인과 사회(조직과 공동체)의 안녕을 추구하는 표현 부재",
            "1": "개인 또는 사회(조직과 공동체)의 안녕을 추구하되 명확하지 않거나 일관성 없는 목적의식 표현",
            "2": "개인 또는 사회(조직과 공동체)의 안녕을 추구하고 명확하면서 일관성 있는 목적의식 표현"
        },
        "의사결정 할 때 행동 결과 평가": {
            "0": "의사결정 과정에서 개인, 조직, 공동체의 행동 결과를 예측하고 평가하는 표현 부재",
            "1": "의사결정 과정에서 개인, 조직, 공동체의 행동 결과를 예측하고 평가하되 예측이 모호하거나 정확성이 떨어짐",
            "2": "의사결정 과정에서 개인, 조직, 공동체의 행동 결과를 예측과 평가하고 예측이 명확하고 정확함"
        }
    }
}

# for category in rubric.items():
#     competency_score = 0
#     for category_detail in category:
#         print(category_detail)
    # for score, description in criteria.items():
    #     print(score, description)
    #     print("\n\n\n")
    #     break
